-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 19, 2017 at 03:03 PM
-- Server version: 10.0.32-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `rahbodco_projects_market`
--

-- --------------------------------------------------------

--
-- Table structure for table `ym_admins`
--

CREATE TABLE `ym_admins` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `email` varchar(255) NOT NULL COMMENT 'پست الکترونیک',
  `role_id` int(11) UNSIGNED NOT NULL COMMENT 'نقش'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_admins`
--

INSERT INTO `ym_admins` (`id`, `username`, `password`, `email`, `role_id`) VALUES
(24, 'admin', '$2a$12$fOCW1/nn/wGJknR/oSOBbOWORhMg90Eol7cJ8yu9rYHVcWH.d/coq', 'admin@gmial.com', 1),
(29, 'rahbod', '$2a$12$fOCW1/nn/wGJknR/oSOBbOWORhMg90Eol7cJ8yu9rYHVcWH.d/coq', 'info@rahbod.com', 1),
(30, 'validator', '$2a$12$fOCW1/nn/wGJknR/oSOBbOWORhMg90Eol7cJ8yu9rYHVcWH.d/coq', 'info@rahbod.com', 2),
(31, 'supporter', '$2a$12$fOCW1/nn/wGJknR/oSOBbOWORhMg90Eol7cJ8yu9rYHVcWH.d/coq', 'info@rahbod.com', 3),
(32, 'accounting', '$2a$12$fOCW1/nn/wGJknR/oSOBbOWORhMg90Eol7cJ8yu9rYHVcWH.d/coq', 'info@rahbod.com', 4);

-- --------------------------------------------------------

--
-- Table structure for table `ym_admin_roles`
--

CREATE TABLE `ym_admin_roles` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL COMMENT 'عنوان نقش',
  `role` varchar(255) NOT NULL COMMENT 'نقش'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_admin_roles`
--

INSERT INTO `ym_admin_roles` (`id`, `name`, `role`) VALUES
(1, 'مدیر', 'admin'),
(2, 'ناظر', 'validator'),
(3, 'پشتیبان', 'supporter'),
(4, 'امور مالی', 'finance');

-- --------------------------------------------------------

--
-- Table structure for table `ym_apps`
--

CREATE TABLE `ym_apps` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(50) DEFAULT NULL,
  `developer_id` int(10) UNSIGNED DEFAULT NULL,
  `category_id` int(10) UNSIGNED DEFAULT NULL,
  `status` enum('disable','enable') CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT 'enable',
  `price` double DEFAULT NULL,
  `icon` varchar(50) DEFAULT NULL,
  `description` longtext,
  `change_log` longtext,
  `permissions` longtext,
  `size` float DEFAULT NULL,
  `confirm` enum('incomplete','pending','refused','accepted','change_required') DEFAULT 'incomplete',
  `platform_id` int(10) UNSIGNED DEFAULT NULL,
  `developer_team` varchar(50) DEFAULT NULL,
  `seen` tinyint(1) UNSIGNED DEFAULT '0' COMMENT 'دیده شده',
  `download` int(12) UNSIGNED DEFAULT '0' COMMENT 'تعداد دریافت',
  `install` int(12) UNSIGNED DEFAULT '0' COMMENT 'تعداد نصب فعال',
  `deleted` tinyint(1) UNSIGNED DEFAULT '0' COMMENT 'حذف شده',
  `support_phone` varchar(11) DEFAULT NULL COMMENT 'تلفن',
  `support_email` varchar(255) DEFAULT NULL COMMENT 'ایمیل',
  `support_fa_web` varchar(255) DEFAULT NULL COMMENT 'وب سایت فارسی',
  `support_en_web` varchar(255) DEFAULT NULL COMMENT 'وب سایت انگلیسی'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_advertises`
--

CREATE TABLE `ym_app_advertises` (
  `app_id` int(10) UNSIGNED NOT NULL,
  `status` tinyint(4) DEFAULT '1',
  `create_date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL,
  `cover` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT 'تصویر'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_buys`
--

CREATE TABLE `ym_app_buys` (
  `id` int(10) UNSIGNED NOT NULL,
  `app_id` int(10) UNSIGNED DEFAULT NULL,
  `user_id` int(10) UNSIGNED DEFAULT NULL,
  `date` varchar(20) DEFAULT NULL COMMENT 'تاریخ'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_categories`
--

CREATE TABLE `ym_app_categories` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(50) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL,
  `parent_id` int(10) UNSIGNED DEFAULT NULL,
  `path` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_app_categories`
--

INSERT INTO `ym_app_categories` (`id`, `title`, `parent_id`, `path`) VALUES
(1, 'برنامه ها', NULL, NULL),
(2, 'بازی ها', NULL, NULL),
(3, 'آموزش ها', NULL, NULL),
(4, 'آب و هوا', 1, '1-'),
(6, 'اخبار و مجلات', 1, '1-'),
(7, 'ارتباطات', 1, '1-'),
(11, 'تفننی', 2, '2-'),
(12, 'مذهبی', 1, '1-'),
(13, 'برنامه آموزشی', 3, '3-'),
(14, 'ابزار‌ها', 1, '1-'),
(15, 'اجتماعی', 1, '1-'),
(16, 'اخبار و مجلات', 1, '1-'),
(17, 'پزشکی', 1, '1-'),
(18, 'پس‌زمینهٔ زنده', 1, '1-'),
(19, 'حمل و نقل', 1, '1-'),
(20, 'خرید', 1, '1-'),
(21, 'سبک زندگی', 1, '1-'),
(22, 'سرگرمی', 1, '1-'),
(23, 'سلامت و تناسب اندام', 1, '1-'),
(24, 'سیر و سفر', 1, '1-'),
(25, 'شخصی‌سازی', 1, '1-'),
(26, 'صوت و موسیقی', 1, '1-'),
(27, 'عکاسی', 1, '1-'),
(28, 'کاربردی', 1, '1-'),
(29, 'کتابخانه و دمو', 1, '1-'),
(30, 'کتاب‌ها و مراجع', 1, '1-'),
(31, 'کسب و کار', 1, '1-'),
(32, 'کمیک', 1, '1-'),
(33, 'مالی', 1, '1-'),
(34, 'ورزشی', 1, '1-'),
(35, 'ویجت‌ها', 1, '1-'),
(36, 'ویدیو و رسانه', 1, '1-'),
(37, 'بازی آموزشی', 3, '3-'),
(38, 'استراتژی', 2, '2-'),
(39, 'تخته‌ای', 2, '2-'),
(40, 'خانوادگی', 2, '2-'),
(41, 'دانستنی‌ها', 2, '2-'),
(42, 'رقابتی', 2, '2-'),
(43, 'شبیه‌سازی', 2, '2-'),
(44, 'کلمات', 2, '2-'),
(45, 'ماجراجویی', 2, '2-'),
(46, 'مسابقه و سرعت', 2, '2-'),
(47, 'معمایی', 2, '2-'),
(48, 'موسیقایی', 2, '2-'),
(49, 'نقش‌آفرینی', 2, '2-'),
(50, 'ورزشی', 2, '2-'),
(51, 'هیجان‌‌انگیز', 2, '2-');

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_discounts`
--

CREATE TABLE `ym_app_discounts` (
  `app_id` int(11) UNSIGNED NOT NULL,
  `start_date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تاریخ شروع',
  `end_date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تاریخ پایان',
  `percent` int(3) UNSIGNED DEFAULT NULL COMMENT 'درصد'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_images`
--

CREATE TABLE `ym_app_images` (
  `id` int(10) UNSIGNED NOT NULL,
  `app_id` int(10) UNSIGNED DEFAULT NULL,
  `image` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_packages`
--

CREATE TABLE `ym_app_packages` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'شناسه',
  `app_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'برنامه',
  `version` varchar(20) DEFAULT NULL COMMENT 'نسخه',
  `package_name` varchar(100) CHARACTER SET utf8 DEFAULT NULL COMMENT 'نام بسته',
  `file_name` varchar(255) DEFAULT NULL COMMENT 'فایل',
  `create_date` varchar(20) DEFAULT NULL COMMENT 'تاریخ بارگذاری',
  `publish_date` varchar(20) DEFAULT NULL COMMENT 'تاریخ انتشار',
  `status` enum('pending','accepted','refused','change_required') DEFAULT 'pending' COMMENT 'وضعیت',
  `reason` text CHARACTER SET utf8 COLLATE utf8_persian_ci COMMENT 'دلیل',
  `for` enum('new_app','old_app') CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_platforms`
--

CREATE TABLE `ym_app_platforms` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL,
  `file_types` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `ym_app_platforms`
--

INSERT INTO `ym_app_platforms` (`id`, `name`, `title`, `file_types`) VALUES
(1, 'android', 'اندروید', 'apk'),
(2, 'ios', 'آی او اس', 'ipa'),
(3, 'windowsphone', 'ویندوزفون', 'xap,appx');

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_ratings`
--

CREATE TABLE `ym_app_ratings` (
  `user_id` int(11) UNSIGNED NOT NULL,
  `app_id` int(11) UNSIGNED NOT NULL,
  `rate` int(1) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_app_special_advertises`
--

CREATE TABLE `ym_app_special_advertises` (
  `app_id` int(10) UNSIGNED NOT NULL COMMENT 'برنامه',
  `cover` varchar(200) COLLATE utf8_persian_ci NOT NULL COMMENT 'تصویر کاور',
  `fade_color` varchar(7) COLLATE utf8_persian_ci DEFAULT '000' COMMENT 'رنگ زمینه',
  `status` tinyint(1) UNSIGNED DEFAULT '1' COMMENT 'وضعیت',
  `create_date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_comments`
--

CREATE TABLE `ym_comments` (
  `owner_name` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `owner_id` int(12) NOT NULL,
  `comment_id` int(12) NOT NULL,
  `parent_comment_id` int(12) DEFAULT NULL,
  `creator_id` int(12) DEFAULT NULL,
  `user_name` varchar(128) COLLATE utf8_persian_ci DEFAULT NULL,
  `user_email` varchar(128) COLLATE utf8_persian_ci DEFAULT NULL,
  `comment_text` text COLLATE utf8_persian_ci,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `status` int(1) NOT NULL DEFAULT '0',
  `is_private` tinyint(4) DEFAULT '0' COMMENT 'خصوصی'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_counter_save`
--

CREATE TABLE `ym_counter_save` (
  `save_name` varchar(10) NOT NULL,
  `save_value` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `ym_counter_users`
--

CREATE TABLE `ym_counter_users` (
  `user_ip` varchar(255) NOT NULL,
  `user_time` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `ym_pages`
--

CREATE TABLE `ym_pages` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) DEFAULT NULL COMMENT 'عنوان',
  `summary` text COMMENT 'متن',
  `category_id` int(11) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_pages`
--

INSERT INTO `ym_pages` (`id`, `title`, `summary`, `category_id`) VALUES
(1, 'درباره ما', '<p dir=\"RTL\">ویژگی اصلی گوشی&zwnj;های هوشمند ایجاد امکان استفاده از برنامه&zwnj;های کاربردی است و گوشی هوشمند بدون استفاده از این برنامه&zwnj;ها تفاوت چندانی با گوشی معمولی ندارد. هایپر اپس،&nbsp;محلی برای دانلود برنامه&zwnj;های اندرویدی و ویندوزفونی و ios است که به&zwnj;طور ویژه به کاربران فارسی&zwnj;زبان سرویس&zwnj;دهی می&zwnj;کند و ده&zwnj;ها هزار برنامه که توسط هزاران توسعه&zwnj;دهنده تهیه شده&zwnj;اند، از طریق آن قابل دسترسی هستند.</p>\r\n\r\n<p dir=\"RTL\">هایپر اپس فرصت مناسبی&zwnj; است برای توسعه&zwnj;دهندگان تا به بازار رو به رشد تلفن&zwnj;های هوشمند قدم بگذارند و کسب درآمد کنند. هم&zwnj;اکنون توسعه&zwnj;دهندگان &nbsp;می&zwnj;توانند با استفاده از پنل مخصوص توسعه&zwnj;دهندگان هایپر اپس، به&zwnj;آسانی برنامه&zwnj;های خود را منتشر، به&zwnj;روزرسانی و مدیریت کنند.</p>\r\n', 1),
(2, 'تماس با ما', '<p>تهران - تهران - تهران-تقاطع یادگار امام و دامپزشکی-کوچه آبگینه-بن بست انبار-پلاک 4-واحد 6 - کدپستی: 1349793141</p>\r\n\r\n<p>تلفن : 02165572767</p>\r\n\r\n<p>ایمیل:&nbsp;hyperapps.ir@gmail.com</p>\r\n', 1),
(3, 'راهنما', '<h3 dir=\"RTL\"><strong>روش ساخت حساب کاربری</strong></h3>\r\n\r\n<p dir=\"RTL\">برای دریافت برنامه&zwnj;های فروشی، اعلام نظر و ارائه امتیاز به برنامه&zwnj;ها، استفاده از کارت هدیه و سایر امتیازات ویژه، ایجاد حساب کاربری ضروری است. ثبت&zwnj;نام و ایجاد حساب کاربری در هایپر اپس&nbsp;ساده است:</p>\r\n\r\n<p>۱- پس از باز کردن سایت هایپر اپس&nbsp;در قسمت سمت چپ&nbsp;بالای صفحه، ثبت نام را انتخاب کنید.<br />\r\n۲- صفحه&zwnj;ای با پیام &laquo;ایمیل و رمز ورود&raquo; به شما نشان داده می&zwnj;شود. آدرس ایمیل خود را در قسمت مربوط وارد و گزینهٔ ثبت نام را انتخاب کنید.<br />\r\n۳- کد تایید به ایمیل وارد شده ارسال خواهد شد.<br />\r\n۴- به ایمیل خود مراجعه کرده و بر روی آن کلیک کنید تا حساب کاربری شما فعال شود.</p>\r\n\r\n<p dir=\"RTL\">بخشی از برنامه&zwnj;های هایپر اپس رایگان نیستند و بخشی نیز به پرداخت درون&zwnj;برنامه&zwnj;ای نیاز دارند. آسان&zwnj;ترین روش خرید یا پرداخت، افزایش اعتبار هایپر اپس و استفاده از این اعتبار است. با کلیک روی گزینه حساب کاربری در قسمت بالای سمت راست صفحه وارد حساب کاربری خود شوید. اعتبار فعلی شما در این صفحه نمایش داده می&zwnj;شود. در همین صفحه می&zwnj;توانید با دو شیوه اعتبار خود را افزایش دهید:&nbsp;<br />\r\n* &nbsp;گزینه افزایش اعتبارهایپر اپس را انتخاب کنید و با تعیین مبلغ افزایش اعتبار، در صفحات بعدی از طریق کارت حساب بانکی خود خرید اینترنتی کنید. برای خرید اینترنتی جهت استفاده از کارت شتاب لازم است موارد زیر را وارد کنید:</p>\r\n\r\n<ul>\r\n	<li dir=\"RTL\">شماره کارت ( شماره ۱۶ تا ۱۹ رقمی روی کارت بانکی)</li>\r\n	<li dir=\"RTL\">رمز دوم PIN2 پنج رقمی&nbsp;کارت</li>\r\n	<li dir=\"RTL\">کد اعتبار سنجی دوم (CVV2)</li>\r\n	<li dir=\"RTL\">تاریخ انقضای کارت</li>\r\n</ul>\r\n\r\n<h3 dir=\"RTL\"><strong>دسترسی به برنامه&zwnj;ها</strong></h3>\r\n\r\n<p dir=\"RTL\">دسترسی به برنامه&zwnj;ها درهایپر اپس از سه طریق ممکن است:<br />\r\n<strong>یک: استفاده از دسته&zwnj;ها</strong></p>\r\n\r\n<p dir=\"RTL\">با انتخاب گزینه دسته&zwnj;&zwnj;ها از نواربالای صفحه، ۲۷ دسته برنامه از قبیل اجتماعی، خرید، آموزش، سلامت، مذهبی و غیره و ۱۶ دسته بازی از قبیل معمایی، ماجراجویی، شبیه&zwnj;سازی، ورزشی و غیره مشاهده می&zwnj;کنید. پس از انتخاب دسته موردنظر ترکیب متنوعی از برنامه&zwnj;های آن دسته نمایش داده می&zwnj;شود.</p>\r\n\r\n<p dir=\"RTL\"><strong>دو: استفاده از لیست&zwnj;های معرفی برنامه&nbsp;</strong>&zwnj;</p>\r\n\r\n<p dir=\"RTL\">هایپر اپس لیست&zwnj;های متعددی از برترین و تازه&zwnj;ترین برنامه&zwnj;ها را در صفحه اول در اختیار شما قرار می&zwnj;دهد و شما می&zwnj;توانید با انتخاب در قسمت هر معیار فهرستی از برنامه&zwnj;ها را مشاهده کنید.&nbsp;در کنار این لیست&zwnj;ها، مجموعه&zwnj;هایی از برنامه&zwnj;ها و بازی&zwnj;ها که موضوع یکسانی دارند در صفحه اول نشان داده می&zwnj;شوند.<br />\r\n<strong>سه: جستجو</strong></p>\r\n\r\n<p dir=\"RTL\">برای جستجوی نام برنامه موردنظر آیکون جستجو را از نوار بالای صفحه هایپر اپس انتخاب و کلیدواژه خود را وارد کنید.</p>\r\n\r\n<h3 dir=\"RTL\"><strong>اطلاعات برنامه</strong></h3>\r\n\r\n<p dir=\"RTL\">پس از کلیک کردن روی نام هر برنامه صفحه&zwnj;ای باز می&zwnj;شود که حاوی جزئیات آن، نظرات سایر کاربران و برنامه&zwnj;های مرتبط است. شما می&zwnj;توانید با استفاده از این اطلاعات در مورد دریافت برنامه تصمیم بگیرید. در قسمت بالای برگه جزئیات می&zwnj;توانید برنامه را به اشتراک بگذارید یا نشان کنید تا به لیست نشان&zwnj;های حساب کاربری شما اضافه شود. برای دسترسی به لیست نشان&zwnj;ها از نوار بالای&nbsp;سایت هایپر اپس روی آن کلیک و نشان&zwnj;شده&zwnj;ها را انتخاب کنید.</p>\r\n\r\n<h3 dir=\"RTL\"><strong>نصب برنامه رایگان</strong></h3>\r\n\r\n<p dir=\"RTL\">برای نصب یک برنامه رایگان دو راه وجود دارد:</p>\r\n\r\n<p dir=\"RTL\"><strong>یک. سایت هایپر اپس حالت ریسپانسیو(در گوشی)</strong></p>\r\n\r\n<p dir=\"RTL\">روی برنامه موردنظر کلیک کنید. گزینه نصب را انتخاب کنید. دریافت برنامه آغاز می&zwnj;شود و پس از دریافت، می&zwnj;توانید آن را نصب کنید.</p>\r\n\r\n<p dir=\"RTL\"><strong>دو. سایت هایپر اپس</strong></p>\r\n\r\n<p dir=\"RTL\">وب&zwnj;&zwnj;سایت هایپر اپس برای مرور راحت&zwnj;تر فهرست برنامه&zwnj;ها و بررسی توضیحات آنها راه&zwnj;اندازی شده است. در صورتی که مایلید ابتدا برنامه مورد نیاز خود را از طریق وب&zwnj;سایت هایپر اپس جستجو کنید و سپس آن را بر دستگاه اندرویدی خود نصب کنید، مطابق این مراحل اقدام کنید.</p>\r\n\r\n<p>۱- به وب سایت&nbsp;هایپر اپس&nbsp;بروید و صفحه برنامه مورد نظر را باز کنید.<br />\r\n۲- روی گزینه رایگان کلیک کنید. &nbsp;QR Code برنامه موردنظر شما نمایش داده می&zwnj;شود.<br />\r\n۳- برای نصب برنامه در دستگاه اندرویدی خود لازم است قبلا یکی از برنامه&zwnj;های رایج QR code reader را نصب کرده باشید &nbsp;برنامه لازم را باز کنید و دوربین دستگاه اندرویدی خود را مقابل QR code نمایش داده شده در سایت هایپر اپس قرار دهید. روی لینک ایجاد شده توسط برنامه کلیک کنید.<br />\r\n۴- حال می&zwnj;توانید به راحتی برنامه مورد نظرتان را از طریق دستگاه اندرویدی نصب کنید.</p>\r\n\r\n<p dir=\"RTL\">پس از خرید به هر روش، برنامه مورد نظر شما دریافت می&zwnj;شود و می&zwnj;توانید آن را نصب کنید.</p>\r\n\r\n<h3 dir=\"RTL\"><strong>نصب برنامه&nbsp;</strong><strong>فروشی</strong></h3>\r\n\r\n<p dir=\"RTL\">برای خرید و نصب یک برنامه فروشی این اقدامات را انجام دهید:</p>\r\n\r\n<p dir=\"RTL\"><strong>&nbsp;سایت هایپر اپس</strong></p>\r\n\r\n<p dir=\"RTL\">صفحه آن را باز و روی گزینه قیمت آن کلیک کنید. در صورتی که اعتبار حساب کاربری شما برای خرید آن کافی باشد، هایپر اپس از شما می&zwnj;خواهد که خرید با کسر اعتبار حساب را تایید کنید. در غیراینصورت ابتدا باید یکی از دو روش پرداخت را انتخاب کنید:<br />\r\nروش اول، افزایش اعتبار و خرید</p>\r\n\r\n<p dir=\"RTL\">اگر مایلید ابتدا اعتبار حساب خود را افزایش دهید و آنگاه برنامه موردنظر را خریداری کنید، این گزینه را انتخاب و مبلغ موردنظر خود را در صفحه بعد معین کنید. در نهایت گزینه خرید را انتخاب کنید و با انتخاب یکی از درگاه&zwnj;های پرداخت نسبت به افزایش اعتبار اقدام کنید. مزیت این روش این است که با یک بار افزایش اعتبار لازم نیست در هر بار خرید مشخصات کارت بانکی خود را وارد کنید.</p>\r\n\r\n<p dir=\"RTL\">روش دوم، پرداخت اینترنتی در برنامه</p>\r\n\r\n<p dir=\"RTL\">اگر مایلید برنامه را به&zwnj;طور مستقیم از طریق کارت حساب بانکی خود خریداری کنید، پس از انتخاب گزینه پرداخت اینترنتی عملیات بانکی مربوطه را انجام دهید. هایپر اپس هیچ وقت بدون امکان نصب برنامه از شما وجهی کسر نمی&lrm;کند و امکان دو بار خریدن یک برنامه را ندارد. اگر درگاه بانکی به مشکل خورد و به هر صورت موفق به نصب برنامه نشدید یا بانک دو بار وجهی را از حساب شما کسر کرد، حداکثر تا سه روز کاری صبر کنید تا وجه توسط بانک به حساب شما برگردانده شود.</p>\r\n\r\n<p dir=\"RTL\">برخی از برنامه&zwnj;های رایگان هایپر اپس در ازای خرید درون&zwnj;برنامه&zwnj;ای خدمات ویژه خود را ارائه می&zwnj;دهند. برای خرید درون&zwnj;برنامه&zwnj;ای، از درون برنامه یا بازی به صفحه پرداخت بازار هدایت می&zwnj;شوید و پس از انجام عملیات خرید، دوباره به محیط برنامه یا بازی بازمی&zwnj;گردید. برای نمایش لیست خریده&zwnj;شده&zwnj;ها وارد حساب کاربری خود شوید. و روی خریده&zwnj;شده&zwnj;ها کلیک کنید. در این صفحه می&zwnj;توانید برنامه&zwnj;هایی را که خریداری کرده&zwnj;اید، مشاهده کنید.</p>\r\n\r\n<h3 dir=\"RTL\"><strong>ارزیابی برنامه</strong></h3>\r\n\r\n<p dir=\"RTL\">در صورتی که برنامه را نصب کرده&zwnj;باشید، می&zwnj;توانید در صفحه آن وارد برگه نظرها شوید. &nbsp;و نظر خود در مورد آن را بنویسید.</p>\r\n\r\n<h3 dir=\"RTL\"><strong>پشتیبانی</strong></h3>\r\n\r\n<p dir=\"RTL\">در صورتی که در پرداخت و یا سایر فعالیت&zwnj;های عمومی هایپر اپس با مشکلی مواجه شدید، با انتخاب منوی&nbsp;هایپر اپس و گزینه پشتیبانی می&zwnj;توانید برای حل مشکل خود اقدام کنید و یا مشکل خود را مستقیماً به ما ایمیل&nbsp;بفرستید.&nbsp;<br />\r\nهمچنین در صورتی که در مورد برنامه خاصی نیاز به پشتیبانی دارید، صفحه برنامه را باز کنید و از قسمت انتهایی آن اطلاعات تماس توسعه&zwnj;دهنده آن را بیابید و از این طریق مشکل ایجادشده را به وی اطلاع دهید. در همین قسمت می&zwnj;توانید با انتخاب گزینه شکایت از برنامه و تعیین یکی از دلایل، توضیحات خود را در شکایت از برنامه&zwnj;ها برای هایپر اپس ارسال کنید.</p>\r\n', 1),
(4, 'شرایط استفاده از خدمات', '<p><strong>شرایط استفاده از هایپر اپس</strong></p>\r\n\r\n<p>هایپر اپس هیچ گونه مسئولیتی در قبال مشکلات احتمالی تلفن همراه شما یا حذف شدن اطلاعات تلفن همراه شما پس از استفاده از هایپر اپس و برنامه های موجود در آن ندارد و مسئولیت آن با خود کاربر است.</p>\r\n\r\n<p><strong>حساب کاربری:</strong></p>\r\n\r\n<p>شما برای استفاده از بعضی از خدمات و امکانات هایپر اپس مانند: خرید برنامه و خرید درون برنامه ای و نشانه گذاری و... نیاز به حساب کاربری دارید.&nbsp;</p>\r\n\r\n<p>حساب کاربری شما امنیت بالایی دارد ،برای حفظ امنیت بیشتر حساب کاربری خود از گذرواژه های طولانی استفاده کنید.&nbsp;</p>\r\n\r\n<p><strong>نظرات:&nbsp;</strong></p>\r\n\r\n<p>شما می توانید به برنامه های مختلف نظر دهید نظرات شما باید متناسب با قوانین جمهوری اسلامی ایران باشد و چنانچه در نظرات تبلیغ،الفاظ رکیک،لینک سایت،نقض قوانین جمهوری اسلامی، غیر مرتبط به برنامه و نوشتن اطلاعات شخصی مثل شماره تلفن دیده شود آن نظر حذف خواهد شد و در صورت تکرار شدن نظرات غیر مجاز توسط &nbsp;یک حساب کاربری، آن حساب معلق خواهد شد.&nbsp;</p>\r\n', 1),
(5, 'حریم شخصی', '<p>حریم شخصی کاربران برای ما بسیار اهمیت دارد.&nbsp;</p>\r\n\r\n<p>اطلاعات شخصی که شما به هنگام ثبت نام به ما میدهید ایمیل خودتان است ، ایمیل شما به صورت محرمانه پیش ما می ماند و از آن فقط جهت خبرنامه هایپر اپس&nbsp;استفاده می شود.</p>\r\n\r\n<p>ما حق داریم اطلاعات اختصاصی دستگاه شما مانند نسخه سیستم عامل، مدل و برند دستگاه &nbsp;شما را جمع آوری کنیم.&nbsp;</p>\r\n\r\n<p>این اطلاعات تنها جهت آمارگیری استفاده میشود وقتی شما یک حساب کاربری در هایپر اپس دارید این اطلاعات برای ما ارسال میشود و ما به کمک این اطلاعات می توانیم خدمات بهتر و بهینه ای در اختیار شما قرار دهیم.</p>\r\n', 1),
(6, 'متن راهنمای تسویه حساب', '<ul>\r\n	<li>در صورتی که می&zwnj;خواهید هر ماه تصفیه&zwnj;حساب شما به یک شبای ثابت انجام شود، کافی است گزینه تصفیه&zwnj;حساب خودکار را انتخاب و شبای خود را وارد نمائید.</li>\r\n	<li>شبای اعلامی تا پایان روز ۲۰ اُم هر ماه قابل تغییر است و پرداخت&zwnj;های هر ماه به آخرین شبای وارد شده در سیستم تا پایان این روز واریز می&zwnj;شود.</li>\r\n	<li>پرداخت بر اساس مبلغ قابل تصفیه شما در پایان روز ۲۰ اُم و به فاصله حداکثر&nbsp;<strong>۵ روز کاری</strong>&nbsp;صورت می&zwnj;گیرد.</li>\r\n	<li>حداقل میزان قابل پرداخت به ناشر 300,000 ریال است</li>\r\n	<li>عواید حاصل از فروش، پس از کسر کسورات قانونی به نسبت 85 درصد سهم ناشر و 15 درصد سهم هایپر اپس&nbsp;تقسیم می&zwnj;شود.&nbsp;</li>\r\n</ul>\r\n', 1),
(7, 'قرارداد توسعه دهندگان', '<p>قرارداد حاضر براساس مادهٔ ۱۰ قانون مدنی، و با تابعیت از کلیهٔ قوانین و مقررات جمهوری اسلامی ایران، به شماره و تاریخ فوق، میان طرفین مندرج در مادهٔ ۱ منعقد می&zwnj;شود و مفاد آن از تاریخ امضاء برای طرفین لازم&zwnj;الاجرا خواهد بود:</p>\r\n\r\n<p>مادهٔ ۱- طرفین قرارداد:</p>\r\n\r\n<p>۱-۱- مارکت هایپر اپس&nbsp;</p>\r\n\r\n<p>۱-۲- آقا/خانم/شرکت ..................................... که از این پس &laquo;توسعه&zwnj;دهنده&raquo; نامیده می&zwnj;شود.</p>\r\n\r\n<p>ماده ۲- تعاریف:</p>\r\n\r\n<p>۱-۲- هایپر اپس&nbsp;: بستر کاربر محور ارائه&zwnj;دهندهٔ خدمات میزبانی، جهت عرضهٔ برنامه&zwnj;ها و یا محتواهای ابزارهای هوشمند است. نشانی اینترنتی سایت</p>\r\n\r\n<p>هایپر اپس&nbsp;، hyperapps.ir است.</p>\r\n\r\n<p>۲-۲- توسعه&zwnj;دهنده: شخص حقیقی یا حقوقی است که برنامهٔ اندرویدی , ویندوزفونی و ios&nbsp;خود را در هایپر اپس&nbsp; عرضه می&zwnj;کند.</p>\r\n\r\n<p>۳-۲- برنامه: منظور نرم&lrm;افزارهای ساخته شده بر بستر اندروید،ویندوزفون&nbsp;و ios بازی&zwnj;ها و سایر محصولات دیجیتالی است که توسعه&zwnj;دهنده برای توزیع و فروش از طریق هایپر اپس&nbsp;ارائه می&zwnj;نماید.</p>\r\n\r\n<p>۴-۲- محتوا: منظور تمام و انواع متعلقات برنامه به هر جنس، شکل و نوعی شامل پایگاه داده&zwnj;، متن و عکس، صدا و فیلم، ظاهر، خدمات، تبلیغات، سایر متعلقات دیجیتالی داخل برنامه، توضیحات قابل دسترسی از طریق برنامه، اطلاعات محصول و دیگر موارد ممکن است.</p>\r\n\r\n<p>۵-۲- پنل توسعه&zwnj;دهنده: فضایی که هایپر اپس به صورت برخط جهت بارگذاری برنامه/محتوا، مدارک شناسایی و سایر متعلقات در اختیار توسعه&zwnj;دهنده قرار می&zwnj;&zwnj;دهد و برخی اطلاعات مربوط به توسعه&zwnj;دهنده در آن نمایش داده می&zwnj;شود و راه ارتباط اصلی و رسمی هایپر اپس و توسعه&zwnj;دهنده است.</p>\r\n\r\n<p>۶-۲- حساب کاربری توسعه&zwnj;دهنده: حسابی است که با اختصاص نام و رمز عبور به توسعه&zwnj;دهنده تعلق گرفته است و توسعه&zwnj;دهنده توسط آن به پنل دسترسی خواهد داشت.</p>\r\n\r\n<p>۷-۲- کاربر: فردی است که از طریق هایپر اپس اقدام به نصب برنامه می&zwnj;کند.</p>\r\n\r\n<p>ماده ۳- موضوع قرارداد:<br />\r\nموضوع قرارداد حاضر، عرضهٔ برنامه یا محتوا توسط توسعه&zwnj;دهنده در هایپر اپس است. بدین منظور هایپر اپس به عنوان ارائه دهندهٔ خدمات میزبانی، فضایی را در اختیار توسعه دهندگان می&zwnj;گذارد تا مطابق با مقررات به نشر و عرضه نرم افزارهای خود در این فضا بپردازند.</p>\r\n\r\n<p>ماده ۴- مدت قرارداد:</p>\r\n\r\n<p>قرارداد حاضر، به مدت یک سال از تاریخ امضای طرفین لازم&zwnj;الاجرا خواهد بود و در صورت عدم فسخ، به طور خودکار و به صورت سالانه تمدید خواهد شد.</p>\r\n\r\n<p>ماده ۵- مبلغ قرارداد:</p>\r\n\r\n<p>برای ثبت نام به عنوان توسعه دهنده کافیست تا به میزان 5000 ریال اعتبار در حساب هایپر اپس کاربر موجودی وجود داشته باشد.</p>\r\n\r\n<p>۵ -۱- چنانچه هایپر اپس بنا بر شرایط تشخیص دهد که باید میزان یا نحوهٔ دریافت مبلغ قرارداد را تغییر دهد، تغییر میزان و نحوهٔ دریافت مبلغ قرارداد از طریق پنل و ایمیل به اطلاع توسعه&zwnj;دهنده خواهد رسید. توسعه&zwnj;دهنده موظف به پرداخت هزینهٔ اعلام شده است و با پرداخت آن به طور ضمنی این شرایط جدید را می&zwnj;پذیرد و در صورت عدم پرداخت آن در مهلت مقرر، هایپر اپس می&zwnj;تواند دسترسی وی به پنل توسعه&zwnj;دهندگان را به حالت تعلیق در بیاورد.</p>\r\n\r\n<p>ماده ۶- حقوق و تعهدات توسعه&zwnj;دهنده:</p>\r\n\r\n<p>۱-۶- به موجب قرارداد حاضر، کلیه حقوق معنوی مربوط به محتوا متعلق به توسعه&zwnj;دهنده خواهد بود.</p>\r\n\r\n<p>۲-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده مسئول تطابق محتوای برنامه با کلیهٔ قوانین و مقررات جمهوری اسلامی ایران و کسب مجوزهای مربوطه شناخته می&zwnj;شود.</p>\r\n\r\n<p>۳-۶- به موجب این قرارداد، توسعه&zwnj;دهنده متعهد می&zwnj;شود که سند &laquo;راهنمای انتشار برنامه&zwnj;ها&raquo; را که در بخش مستندات سایت قرار دارد و به عنوان پیوست این قرارداد محسوب و بخش لاینفکی از آن تلقی می&zwnj;شود، به دقت مطالعه و به آن عمل نموده و تعهدات و شرایط آن را می&zwnj;پذیرد.</p>\r\n\r\n<p>۴-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده تضمین می&zwnj;کند که از اهلیت قانونی لازم برای انعقاد معاملات برخوردار است و چنانچه به نمایندگی از یک شخص حقوقی به عنوان توسعه&zwnj;دهنده این قرارداد را منعقد می&zwnj;نماید، دارای اختیار قانونی لازم برای این کار است و مدارک نمایندگی خود را به هایپر اپس ارائه می&zwnj;دهد.</p>\r\n\r\n<p>۵-۶- توسعه&zwnj;دهنده مسئول است پیش از ارائهٔ هرگونه محتوا به هایپر اپس، اختیارات قانونی لازم به منظور اعمال حقوق ناشی از این قرارداد را کسب نموده، و فارغ از هرگونه ادعا از سوی اشخاص ثالث اختیار عرضه آن را دارا باشد.</p>\r\n\r\n<p>۶-۶- توسعه&zwnj;دهنده اقرار می&zwnj;نماید که از کلیهٔ مقررات قانونی از جمله مفاد قانون حمایت از حقوق پدیدآورندگان نرم&zwnj;افزارهای رایانه&lrm;ای مصوب ۱۳۷۹، قانون تجارت الکترونیک، قانون حمایت از حقوق مؤلفان، مصنفان و هنرمندان و سایر قوانین مربوط اطلاع کامل دارد و پای&zwnj;بند به رعایت آن&zwnj;ها است. در صورت ادعا یا مطالبه حق از ناحیهٔ اشخاص ثالث، مسئول پاسخ&zwnj;گویی و جبران خسارات احتمالی خواهد بود وهایپر اپس هیچ&zwnj;گونه مسئولیتی در این خصوص نخواهد داشت.</p>\r\n\r\n<p>۷-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده در خصوص هرگونه ادعای کاربران یا سایر اشخاص نسبت به برنامه یا محتوای ارائه شده از هر حیث پاسخ&zwnj;گو خواهد بود و هایپر اپس مسئولیتی نسبت به این دعاوی نخواهد داشت.</p>\r\n\r\n<p>۸-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده متعهد به تحویل صحیح و کامل برنامه&zwnj; و یا محتوا از قبیل اشتراک و محصولات درون&zwnj;برنامه&zwnj;ای (در طول بازهٔ زمانی مربوط به آن) و یا سایر موارد ارائه&zwnj; شده به کاربر است. در غیر این&zwnj; صورت مسئولیت تأمین خسارات وارده به هایپر اپس،کاربر یا هر شخص ثالث دیگر بر عهدهٔ توسعه&zwnj;دهنده خواهد بود.</p>\r\n\r\n<p>۹-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده مجاز به درخواست هیچ نوع دسترسی به اطلاعات کاربر در برنامهٔ خود، به جز آن&lrm;چه مورد نیاز کارآیی برنامه است، نبوده و در غیر این صورت مسئولیت ناشی از آن را بر عهده خواهد داشت. هایپر اپس حق بررسی دسترسی&zwnj;های هر برنامه و نسخه&zwnj;های به روزرسانی آن را داراست. چنانچه توسعه&zwnj;دهنده در نتیجهٔ استفادهٔ کاربران از محتوای تولید شده، به هرگونه اطلاعات شخصی کاربران از جمله نام، رمز عبور، یا سایر اطلاعات و داده&zwnj;های شخصی آنان دسترسی پیدا کند، متعهد است:</p>\r\n\r\n<p>الف- کلیه قوانین و مقررات جمهوری اسلامی ایران در رابطه با حریم خصوصی را رعایت نماید و در صورت نقض، عواقب آن را بپذیرد.</p>\r\n\r\n<p>ب- تنها برای مقاصدی که کاربر مجاز دانسته است از این اطلاعات استفاده نماید.</p>\r\n\r\n<p>ج- هرگونه گردآوری، استفاده، تغییر و ذخیرهٔ اطلاعات کاربران را تنها با اجازهٔ کاربر و به صورت آشکارا انجام دهد.</p>\r\n\r\n<p>۱۰-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده مسئول حفاظت از نام کاربری و رمز عبور پنلی که به او اختصاص یافته است، شناخته می&zwnj;شود و مسئولیت تمامی فعالیت&zwnj;هایی را که با نام کاربری او انجام می&zwnj;گیرند، بر عهده خواهد داشت.</p>\r\n\r\n<p>۱۱-۶- درصورتی که به تشخیص هایپر اپس، توسعه&zwnj;&zwnj;دهنده هر یک ازمواد قرارداد حاضر را نقض نموده یا مرتکب تخلف شود، هایپر اپس مجاز به متوقف نمودن همکاری شامل حذف برنامه، حذف محصولات درون&zwnj;برنامه&zwnj;ای، تعلیق حساب کاربری، توقف تصفیه&zwnj;حساب، غیرفعال نمودن حساب کاربری هایپر اپس و ... خواهد بود. قطع همکاری می&zwnj;تواند به صورت یک&zwnj;جانبه و بدون نیاز به اطلاع&zwnj;رسانی قبلی انجام گیرد و هایپر اپس می&zwnj;تواند اقدام به تعیین خسارت مربوطه بنماید.</p>\r\n\r\n<p>موارد تخلف شامل و نه محدود به موارد زیر است:</p>\r\n\r\n<p>الف- عرضه برنامه&zwnj;های خارجی یا ایرانی توسعه&zwnj;دهندگان دیگر به نام خود.</p>\r\n\r\n<p>ب- هرگونه نقض حقوق مالکیت فکری اشخاص ثالث اعم از مادی ومعنوی و عرضهٔ هرگونه نسخهٔ ترجمه یا دستکاری شدهٔ برنامه&zwnj;های دیگران بدون رضایت صاحب اصلی برنامه.</p>\r\n\r\n<p>ج- انجام هرگونه فعالیت متقلبانه که به طور غیرعادی و غیرواقعی منجر به رشد و یا نزول برنامه و یا محتوای ارائه&zwnj;شده از سوی خود و یا دیگر توسعه&zwnj;دهندگان گردد. برای مثال، نصب انبوه برنامه&zwnj;های خود با هدف معرفی برنامه به کاربران به عنوان یک برنامهٔ پرنصب یا ارائهٔ نظرات و رتبه&zwnj;دهی مثبت یا منفی به تعداد زیاد توسط توسعه&zwnj;دهنده به برنامه خود یا دیگر توسعه&zwnj;دهندگان.</p>\r\n\r\n<p>د- هرگونه تلاش در راستای فریب دادن کاربران، در برنامه&zwnj;های خود و دیگر توسعه&lrm;دهندگان شامل دستکاری در سیستم هایپر اپس و یا ارائهٔ هر نوع پیشنهاد به کاربر در جهت ترغیب وی به ارسال نظر از طریق سایر مشوق&zwnj;ها، مانند اهدای جوایز درون و خارج از برنامه منتشر شده درهایپر اپس.</p>\r\n\r\n<p>ه- عدم پشتیبانی و پاسخ&zwnj;گویی به مشکلات و پرسش&zwnj;&zwnj;های کاربران و هایپر اپس در خصوص بخش&zwnj;های مختلف برنامه،کارکرد و تغییر در هریک از بخش&zwnj;های داخلی و یا توضیحات برنامه درهایپر اپس پس از انتشار که منجر به نارضایتی کاربران شود.</p>\r\n\r\n<p>و- عدم رعایت موازین و شئونات اخلاقی و عرفی نسبت به هایپر اپس و کاربران در کلیه مکاتبات و تماس&zwnj;ها.</p>\r\n\r\n<p>ز- در دسترس قرار ندادن راه&zwnj;های ارتباطی پاسخ&zwnj;گو مانند ایمیل و شماره تماس در داخل برنامه و صفحه برنامه در هایپر اپس جهت تماس کاربران.</p>\r\n\r\n<p>۱۲-۶- همراه با تحویل هر برنامه باید اطلاعات لازم، قالب و نحوهٔ ارسال برنامه&zwnj;&zwnj;ها یا نسخه&zwnj;های به&zwnj;روزرسانی نیز به شرح فرآیند معمول هایپر اپس جهت انتشار ارائه گردد. توسعه&zwnj;دهنده موظف به ارائهٔ اطلاعات صحیح در این خصوص است.</p>\r\n\r\n<p>۱۳-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده موظف به ارسال مدارک و ارائه اطلاعات ذیل در پنل توسعه&zwnj;دهندگان خواهد بود:</p>\r\n\r\n<p>الف) اشخاص حقیقی:</p>\r\n\r\n<p>تصویر کارت شناسایی ملی، کدپستی محل سکونت، شمارهٔ تلفن و نشانی دقیق محل سکونت.</p>\r\n\r\n<p>ب) اشخاص حقوقی:</p>\r\n\r\n<p>تصویر روزنامهٔ رسمی تأسیس و روزنامهٔ رسمی آخرین تغییرات شرکت و معرفی صاحبان امضای مجاز، شمارهٔ تلفن، کد اقتصادی، شناسهٔ ملی، شمارهٔ ثبت، نشانی دقیق شرکت و کدپستی.</p>\r\n\r\n<p>۱۴-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده موافقت می&zwnj;نماید که علامت و نام تجاری &laquo;هایپر اپس&raquo;&nbsp;یا هر علامت دیگر متعلق به آن را، مگر به موجب رضایت پیشین هایپر اپس و یا در مواردی که فرآیند مربوط به آن در بخش رسانه&zwnj;های سایت هایپر اپس آمده است، به هیچ وجه مورد استفاده قرار ندهد.</p>\r\n\r\n<p>۱۵-۶- به موجب قرارداد حاضر توسعه&zwnj;دهنده متعهد است در صورت تغییر اطلاعات تماس خود آن را فوراً به اطلاع بازار برساند.</p>\r\n\r\n<p>۱۶-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده مجاز به اجبار کاربران برای ایجاد ارتباط&zwnj;های خارج از هایپر اپس اعم از تماس تلفنی، پیامکی، ایمیلی، اینترنتی، ثبت &zwnj;نام در وب&zwnj;سایت&zwnj;های دیگر و یا مراجعه حضوری، به هر دلیلی جهت فعا&zwnj;&zwnj;ل&zwnj;سازی برنامه، استفاده از برنامه&zwnj;، امکانات برنامه، رفع مشکل، اطلاع&zwnj;رسانی، به&zwnj;روزرسانی و دیگر موارد، بدون اطلاع و رضایت کامل کاربر نخواهد بود.</p>\r\n\r\n<p>۱۷-۶- به موجب قرارداد حاضر، توسعه&zwnj;دهنده متعهد است برنامه و یا محتوا را به ازای یک بار دریافت کاربر با حساب هایپر اپس در تعداد دستگاه&zwnj;&zwnj;های نامحدود در اختیار وی قرار دهد.</p>\r\n\r\n<p>۱۸-۶- توسعه&zwnj;دهنده می&zwnj;تواند تقاضای انتقال قرارداد به دیگری را به هایپر اپس ارائه نماید. هایپر اپس ظرف مدت هفت روز به این تقاضا رسیدگی خواهد کرد.</p>\r\n\r\n<p>ماده۷- حقوق و تعهداتهایپر اپس:</p>\r\n\r\n<p>۱-۷- به موجب قرارداد حاضر، هایپر اپس می&zwnj;تواند:</p>\r\n\r\n<p>الف- محتوای ارائه شده توسط توسعه&zwnj;دهنده و محتوای پیوند داده شده با آن را به منظور ارزیابی و آزمایش، مورد استفاده قرار داده و آن را روی یک یا چند دستگاه نگهداری نماید.</p>\r\n\r\n<p>ب- بعد از خاتمه قرارداد، نسخهٔ برنامه و اطلاعات مربوط به آن را نگهداری نموده و حافظهٔ اطلاعاتی مربوط به سوابق حضور برنامه در هایپر اپس را نیز حفظ نماید.</p>\r\n\r\n<p>ج- نسبت به انتشار، عدم انتشار و حذف نظرات کاربران در هر کجا و در هر موردی اقدام کند و در مواردی که نظرات یک برنامه به هر دلیلی براساس تشخیص هایپر اپس قابل کنترل نباشد، ارسال نظرات برای یک برنامه&zwnj; را غیرفعال کند.</p>\r\n\r\n<p>۲-۷- هایپر اپس می&zwnj;تواند در هر زمان به تشخیص خود نسبت به تغییر، به&zwnj;روزرسانی، بهبود یا اصلاح در پنل توسعه&zwnj;دهندگان، برنامه و سایت هایپر اپس اقدام نماید.</p>\r\n\r\n<p>۳-۷- به موجب این قرارداد، هایپر اپس هیچ&zwnj;گونه مسئولیتی در رابطه با خسارات وارد شده به توسعه&zwnj;دهنده، از جمله از دست رفتن داده یا محتوا، سود، یا شهرت تجاری وی ندارد.</p>\r\n\r\n<p>۴-۷- به موجب این قرارداد، سایت، محتوا، خدمات یا سایر اطلاعاتی که توسط هایپر اپسر و اشخاص وابسته به آن، مسئولان، مدیران، کارکنان، نمایندگان، شرکاء و دارندگان امتیاز (که مجموعاً تحت عنوان هایپر اپس از آن&zwnj;ها نام برده می&zwnj;شود) به توسعه&zwnj;دهنده ارائه می&zwnj;گردد، بر اساس داشته&zwnj;های فعلی است. هایپر اپس تلاش خواهد نمود تا این اطلاعات دقیق، قابل اتکاء، به موقع، بدون اشکال یا قطعی باشند. با این حال به دلیل بروز مشکلات احتمالی، هایپر اپس نمی&zwnj;تواند این موارد را تضمین نماید.</p>\r\n\r\n<p>۵-۷- به موجب این قرارداد، هایپر اپس نمی&zwnj;تواند عدم سوء استفاده از محتوای توسعه&zwnj;دهنده را تضمین نماید و هیچ&zwnj;گونه مسئولیتی در قبال نواقص امنیت فناوری نخواهد داشت.</p>\r\n\r\n<p>۶-۷- به موجب این قرارداد، در صورت مشاهدهٔ هرگونه تلاش جهت رخنه و نفوذ به بخش&lrm;های مختلف و یا ایجاد تغییر در هر محتوای ارائه شده توسط هایپر اپس، حق پیگیری از طریق مراجع قانونی و قضایی برای هایپر اپس محفوظ است.</p>\r\n\r\n<p>۷-۷- هایپر اپس می&zwnj;تواند در مواقع لزوم نسبت به حمایت از حقوق مادی و معنوی در ارتباط با برنامه و محتوای ارائه&zwnj;شده از سوی توسعه&zwnj;دهنده از طرق مختلف قانونی اقدام نماید، با وجود این مسئولیتی در قبال هرگونه سوء استفاده اشخاص ثالث و یا نقض احتمالی حقوق توسعه&zwnj;دهنده توسط اشخاص ثالث نخواهد داشت.</p>\r\n\r\n<p>۸-۷- هایپر اپس مجاز است شرایط و بندهای قرارداد را در هر زمان تغییرداده و یا اصلاح نماید. تغییرات به محض به&zwnj;روزرسانی و یا در زمانی که هایپر اپس معین می&zwnj;کند، لازم&zwnj;الاجرا خواهند بود. توسعه&zwnj;دهنده مسئولیت بررسی به&zwnj;روزرسانی احتمالی قرارداد را بر عهده دارد. این تغییر از طریق پنل کاربری به اطلاع توسعه&zwnj;دهنده رسیده و استمرار همکاری با هایپر اپس پس از لازم الاجرا شدن این تغییرات به منزلهٔ قبول این تغییرات است.</p>\r\n\r\n<p>۹-۷- در صورتی که در خصوص هر یک از شروط عدم مسئولیت یا تحدید مسئولیت یا نقض هر یک از مقررات کشور در رابطه با توزیع برنامه و محتوای توسعه&zwnj;دهنده، مسئولیتی بر هایپر اپس تحمیل گردد، توسعه&zwnj;دهنده موظف است که کلیهٔ خسارات مادی و معنوی وارده بر هایپر اپس را جبران نماید.</p>\r\n\r\n<p>۱۰-۷-هایپر اپس در صورت لزوم، اطلاعات مربوط به توسعه&zwnj;دهندگان را با دستور رسمی نهادهای قضایی و انتظامی، در اختیار ایشان قرار خواهد داد.</p>\r\n\r\n<p>ماده ۸- محرمانگی:<br />\r\nبه موجب قرارداد حاضر، طرفین به طور متقابل متعهد به حفظ اطلاعات فنی و غیرفنی محرمانه&zwnj;ای هستند که به موجب همکاری&zwnj;&zwnj;های موضوع این قرارداد با یکدیگر به اشتراک گذاشته&zwnj;اند. اطلاعات محرمانه اطلاعاتی هستند که عرفاً محرمانه تلقی می&zwnj;شوند یا محرمانگی آن&zwnj;ها تصریح شده است.</p>\r\n\r\n<p>ماده ۹- خاتمه و فسخ قرارداد:</p>\r\n\r\n<p>۱-۹- هایپر اپس می&zwnj;تواند در مدت اعتبار این قرارداد بنا به تشخیص خود، قرارداد را خاتمه داده و با اخطار قبلی یا بدون آن دسترسی توسعه&zwnj;دهنده به حساب کاربری را مسدود نموده، برنامه&lrm;ها را حذف کرده و یا حساب کاربری توسعه&zwnj;دهنده را معلق نماید. در این صورت تمامی حقوق و امتیازات اعطا شده از جانب هایپر اپس به توسعه&zwnj;دهنده متوقف خواهد شد و حق هایپر اپس برای رد درخواست مجدد همکاری با توسعه&zwnj;دهنده محفوظ است.</p>\r\n\r\n<p>۲-۹- توسعه&zwnj;دهنده در مدت اعتبار این قرارداد می&zwnj;تواند با اخطار کتبی و قبلی ده روزه قرارداد حاضر را فسخ نماید. در این صورت هایپر اپس عرضهٔ برنامه&zwnj;های توسعه&zwnj;دهنده را متوقف خواهد نمود. اما هایپر اپس هیچ&zwnj;&zwnj;گونه تعهدی نسبت به بازگرداندن کپی محتوا، هزینهٔ سالانه قرارداد یا سایر موارد ارائه شده توسط توسعه&zwnj;&zwnj;دهنده نخواهد داشت. در صورت خاتمه این قرارداد طرفین همچنان نسبت به مادهٔ ۸ قرارداد حاضر متعهد خواهند بود.</p>\r\n\r\n<p>ماده ۱۰- تفسير قرارداد</p>\r\n\r\n<p>۱-۱۰- بنا بر توافق طرفين، در تفسیر و اجرای این قرارداد، هر امری كه در نتيجه در نظر نگرفتن &laquo;حسن نیت&raquo; حاصل شود فاقد اعتبار و برخلاف قصد و رضای طرفين عقد است. همچنين در تفسير قرارداد موجود کلیهٔ شرایط، اعم از مذاکرات طرفین، اوضاع و احوال حاکم بر انعقاد قرارداد، هدف از انعقاد آن، روح کلی حاکم بر قرارداد و نيز عرف حاکم بر این نوع معاملات و منطق مد نظر قرار خواهد گرفت.</p>\r\n\r\n<p>۲-۱۰- در صورتی که به موجب حکم دادگاه یا قوانین جاری کشور، هر یک از مقررات این قرارداد نامعتبر شناخته شود، اولاً خدشه&zwnj;ای به سایر مفاد قرارداد وارد نشده و ثانیاً پیشنهاد هایپر اپس در خصوص اجرای سایر مفاد قرارداد به نحوی که بیشترین تطابق را با ارادهٔ اولیه طرفین داشته باشد، پذیرفته خواهد شد.</p>\r\n\r\n<p>ماده ۱۱- حل و فصل اختلافات&nbsp;</p>\r\n\r\n<p>کلیهٔ اختلافات و دعاوی ناشی از این قرارداد و یا راجع به آن از جمله انعقاد، اعتبار، فسخ، نقض، تفسیر یا اجرای آن در ابتدا از طریق صلح و سازش فصل خواهد شد؛ چنانچه اختلافات مزبور ظرف مدت یک ماه از تاریخ ابلاغ اعلامیهٔ حدوث اختلاف از این طریق حل و فصل نگردد این امر به مرکز داوری اتاق ایران ارجاع می&zwnj;گردد که مطابق با قانون اساسنامه و آئین داوری آن مرکز با رأی یک یا سه نفر داور بصورت قطعی و لازم الاجراء حل و فصل گردد. داور(ان) علاوه بر مقررات حاکم، عرف تجاری ذی&zwnj;ربط را نیز مراعات خواهد (خواهند) نمود. شرط داوری حاضر، موافقتنامه&zwnj;ای مستقل از قرارداد اصلی تلقی می&zwnj;شود و در هر حال لازم الاجراء است.</p>\r\n\r\n<p>ماده ۱۲- سایر مقررات</p>\r\n\r\n<p>۱-۱۲- این قرارداد تابع قوانین جمهوری&zwnj; اسلامی ایران است.</p>\r\n\r\n<p>۲-۱۲- عدم اعمال هریک از حقوق هایپر اپس (مصرح در این قرارداد) به منزلهٔ انصراف از حق اعمال و اجرای آن در آینده نخواهد بود.</p>\r\n\r\n<p>۳-۱۲- قرارداد حاضر متضمن کلیهٔ توافقات طرفین بوده و توافقات و اظهارات پیشین، اعم از شفاهی و کتبی، در ارتباط با موضوع این قرارداد از تاریخ انعقاد فاقد هرگونه اثر خواهد بود.</p>\r\n\r\n<p>۴-۱۲ - کلیه اخطارها، پیام&zwnj;ها و مکاتبات هایپر اپس از طریق آدرس ایمیل&zwnj;های تحت دامنه hyperapps.ir، به&zwnj;روزرسانی مستندات، پنل و یا وبلاگ رسمی توسعه&zwnj;دهندگان صورت می&zwnj;گیرد. هایپر اپس مسئولیتی در خصوص عدم توجه و یا عدم مشاهده پیام&zwnj;ها توسط توسعه&zwnj;دهنده نخواهد داشت.</p>\r\n\r\n<p>۵-۱۲- در خصوص حقوق مادی برنامه&zwnj;ها و یا محتواهایی که عرضه آن ها معوض (غیررایگان) است،&zwnj; متمم قرارداد حاضر در ۳ ماده مجری خواهد بود.</p>\r\n\r\n<p>۶-۱۲- قرارداد حاضر که شامل ۱۲ ماده و یک متمم است، در ۲ نسخه که تماماً حکم واحد را داشته توسط طرفین تنظیم، امضاء و مبادله گردیده و طرفین متعهد به اجرای کلیه تعهدات مربوط به خود شده&zwnj;اند.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>متمم قرارداد&zwnj; عرضهٔ برنامه&zwnj; و محتوای دیجیتال</strong></p>\r\n\r\n<p>عطف به بند ۵-۱۲ قرارداد توسعه&zwnj;دهندگان،&zwnj; قرارداد حاضر در خصوص حقوق مادی برنامه&zwnj;ها و یا محتواهایی که عرضه آن&zwnj;ها معوض (غیررایگان) است،&zwnj; مجری خواهد بود.</p>\r\n\r\n<p>ماده ۱- فروش و پرداخت:<br />\r\n۱-۱- قیمت فروش هر برنامه و یا محتوا به هایپر اپس توسط توسعه&zwnj;دهنده در پنل اختصاصی وی تعیین می&zwnj;گردد. هایپر اپس این برنامه یا محتوا را به قیمت صد هفتادم قیمت خرید آن از توسعه&zwnj;دهنده به علاوه مالیات بر ارزش افزوده متعلق، به کاربران خود می&zwnj;فروشد.</p>\r\n\r\n<p>۲-۱- پس از تکمیل فرآیند خرید برنامه و یا محتوا (محصولات درون&zwnj;برنامه&zwnj;ای، اشتراک و &hellip;) از سوی کاربر، هایپر اپس یک فاکتور الکترونیک برای کاربر صادر می&zwnj;کند. مبلغ مالیات دریافتی از کاربر بابت این فروش تماماً به اداره مالیات بر ارزش افزوده پرداخت می&zwnj;شود و همزمان یک فروش از توسعه&zwnj;دهنده بههایپر اپس با قیمت تعیین&zwnj;شده طبق بند ۱-۱ ثبت می&zwnj;شود.</p>\r\n\r\n<p>۳-۱- توسعه دهنده به هایپر اپس اجازه می دهد که در صورت مواجهه با شکایت کاربران، به تشخیص خود اقدام به بازگرداندن مبلغ پرداختی کاربران نماید و فروش برنامه و یا محتوا از طرف خود به آنان را برگشت بزند. بدین ترتیب به ازای هر برگشت از فروش به کاربر، یک برگشت از فروش از سوی توسعه&zwnj;دهنده به هایپر اپس نیز ثبت می&zwnj;شود.</p>\r\n\r\n<p>۴-۱- تمامی نسخه&zwnj;های به&zwnj;روزرسانی برنامه، به ازای یک بار دریافت، همواره به طور رایگان قابل دریافت خواهد بود.</p>\r\n\r\n<p>۵-۱- هایپر اپس با توجه به میزان فروش و برگشت از فروش&zwnj;های برنامه و یا محتوا در بازه&zwnj;های زمانی مشخص، یک فاکتور فروش از سوی توسعه&zwnj;دهنده به هایپر اپس، به طور خودکار صادر می&zwnj;کند و فایل الکترونیکی آن را در اختیار توسعه&zwnj;دهنده قرار می&zwnj;دهد. این فاکتور به عنوان ضمیمهٔ این قرارداد، سند مثبتهٔ خرید نسخه&zwnj;های نرم&zwnj;افزار توسط هایپر اپس از توسعه&zwnj;دهنده است. توسعه&zwnj;دهنده با امضای این قرارداد می&zwnj;پذیرد که صورت&zwnj;حساب مذکور مورد تأیید وی جهت ارائه به مراجع مالیاتی است و در صورت نیاز طبق روالی که هایپر اپس مشخص می&zwnj;کند، نسبت به تأیید و امضای آن اقدام خواهد کرد.</p>\r\n\r\n<p>۶-۱- هایپر اپس هر ماه یک بار نسبت به تصفیه&zwnj;حساب مبالغ مربوط به خرید برنامه و یا محتوا از توسعه&zwnj;دهنده، اقدام می&zwnj;کند.</p>\r\n\r\n<p>۷-۱- به منظور تصفیه&zwnj;حساب هایپر اپس با توسعه&zwnj;دهنده، باید از زمان ثبت برنامه در هایپر اپس حداقل دو هفته سپری شده باشد و حساب توسعه&zwnj;دهنده نزد هایپر اپس باید در روز پرداخت حداقل به مبلغ &nbsp;پانصد هزار&nbsp;ریال باشد. مبالغ کمتر از مبلغ ذکر شده در پایان سال و به درخواست توسعه&zwnj;دهنده تصفیه خواهند شد.</p>\r\n\r\n<p>۸-۱- پرداخت مبالغ فوق از طریق واریز به شبایی انجام خواهد گرفت که توسعه&zwnj;دهنده در پنل توسعه&zwnj;دهندگانهایپر اپس ثبت نموده است. توسعه&zwnj;دهنده به موجب این قرارداد، انتساب شبای مذکور به خود را تصدیق می&zwnj;&zwnj;کند. در غیر این صورت، هایپر اپس مسئولیتی در این خصوص نخواهد پذیرفت. اسناد واریزی به شبای وارد شده در پنل، به منزله تصفیه&zwnj;حساب هایپر اپس با توسعه&zwnj;دهنده خواهند بود.</p>\r\n\r\n<p>ماده ۲- مالیات و عوارض:</p>\r\n\r\n<p>۱-۲- در خصوص مسائل مالیاتی هر یک از طرفین مسئول تمام فعالیت&zwnj;های خود، اظهار و پرداخت مالیات&zwnj;های مربوطه هستند. هایپر اپس در خصوص ثبت اسناد و ارائه گزارشات به طور کامل از قوانین دارائی و مالیاتی کشور پیروی می&zwnj;کند و هیچ مسئولیتی در قبال نحوه ارائه گزارش&zwnj;های مالیاتی توسعه&zwnj;دهندگان برعهده ندارد.</p>\r\n\r\n<p>۲-۲- هرگونه کسورات قانونی مطابق دستورالعمل&zwnj;ها و تعرفه&zwnj;های رسمی کشور اعم از این&zwnj;که در زمان یا بعد از انعقاد قرارداد وضع شود، در محاسبات و صورت&zwnj;حساب&zwnj;ها لحاظ شده و به مراجع ذی&zwnj;ربط پرداخت خواهد شد.</p>\r\n\r\n<p>ماده ۳- مواد و نسخ قرارداد:</p>\r\n\r\n<p>متمم حاضر در ۳ ماده به عنوان جزء اختیاری قرارداد توسعه&zwnj;دهندگان در خصوص عرضه معوض برنامه و محتوا امضاء و مبادله گردیده و طرفین متعهد به اجرای کلیه بندهای آن هستند</p>\r\n', 1),
(11, 'راهنمای پنل توسعه دهندگان', '<p style=\"text-align:justify\">مدیریت برنامه&zwnj;ها، حساب توسعه&zwnj;دهنده، امور مالی و فروش، ارتباط با بخش پشتیبانی بازار و دسترسی به مستندات فنی همگی از طریق پنل توسعه&zwnj;دهندگان قابل انجام هستند و شرح این موارد در ادامه آمده است.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">ضمناً ما در &laquo;راهنمای انتشار برنامه&zwnj;ها&raquo; سعی کردیم معیار و شرایط بازار را تا حد ممکن شرح دهیم. لطفاً&nbsp;این شرایط را در&nbsp;<a href=\"https://cafebazaar.ir/developers/docs/app-publish/guideline/\">اینجا</a>&nbsp;مطالعه بفرمایید.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h3 dir=\"rtl\" style=\"text-align:justify\">مشاهدهٔ وضعیت و فروش برنامه&zwnj;ها</h3>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">در سربرگ اول به نام &laquo;برنامه&zwnj;ها&raquo;، وضعیت انتشار برنامه&zwnj;ها، قیمت آن&zwnj;ها، تعداد صورت&zwnj;حساب&lrm;ها برای برنامه&zwnj;های غیررایگان، تعداد نصب و امتیاز هر برنامه قابل مشاهده است. تعداد نصب&zwnj;ها برای هر برنامه، تخمینی و تعداد صورت&zwnj;حساب&lrm;ها برای برنامه&zwnj;های فروشی دقیق می&zwnj;باشد. در این سربرگ با کلیک روی هر برنامه می&zwnj;توانید هر کدام را مدیریت کنید.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h3 dir=\"rtl\" style=\"text-align:justify\">انتشار برنامهٔ جدید</h3>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">در سربرگ اول به نام &laquo;برنامه&zwnj;ها&raquo;، با کلیک روی دکمهٔ &laquo;برنامهٔ جدید&raquo; می&zwnj;توانید برنامه&zwnj;ای جدید بارگذاری کنید. قالب فایل ارسالی باید apk باشد و قالب&zwnj;هایی مثل zip و rar مورد قبول نیستند. پس از ارسال برنامه از این سربرگ، باید مشخصات برنامه را تکمیل نمایید و با استفاده از دکمهٔ &laquo;درخواست انتشار برنامه&raquo; در نوار بالای صفحه، برنامه را در وضعیت &laquo;در صف انتظار&raquo; قرار دهید تا توسط بازار بررسی شود.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">اگر برنامه نیاز به تغییر داشته باشد یا مطابق شرایط بازار نباشد یا به هر دلیل دیگری، تغییری در وضعیت برنامهٔ شما توسط بازار ایجاد شود، ایمیلی حاوی توضیحات مربوطه به شما ارسال خواهد شد. لطفاً قبل از ارسال مجدد برنامه برای انتشار یا هر اقدام دیگری، ایمیل ارسال شده را ملاحظه بفرمایید. اگر ایمیل به دست شما نرسیده بود، پوشهٔ اسپم&zwnj; ایمیل&zwnj;تان را نیز بررسی کنید.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">توجه فرمایید که پیام&zwnj;ها به ایمیلی ارسال می&zwnj;شود که با آن در بازار عضو شده و به عنوان توسعه&zwnj;دهنده ثبت&zwnj;نام کرده&zwnj;اید و نه ایمیلی که در بخش اطلاعات پشتیبانی کاربر در پنل وارد کرده&zwnj;اید.&nbsp;</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h3 dir=\"rtl\" style=\"text-align:justify\">تکمیل یا ویرایش مشخصات برنامه</h3>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">پس از بارگذاری هر برنامه می&zwnj;توانید&nbsp;برای تکمیل اطلاعات یا برای ویرایش اطلاعات برنامه&zwnj;های قبلی اقدام کنید.</p>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">&nbsp;</h4>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">اطلاعات پایه</h4>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">با انتخاب هر برنامه به سر&rlm;برگ&zwnj; &laquo;اطلاعات&raquo; و سپس بخش &laquo;اطلاعات پایه&raquo; مراجعه کنید. در این قسمت می&zwnj;توانید مشخصات پایه&zwnj;ای برنامهٔ خود (نام، توضیحات و دسته&zwnj;بندی) را تغییر دهید. دقت کنید که پر کردن فیلد&zwnj;های این قسمت ضروری است.&nbsp;توجه داشته باشید برای برنامهٔ خود نام&zwnj;هایی را به کار برید که قبلاً در بازار استفاده&zwnj; نشده است زیرا برنامه&zwnj;های با نام مشابه در بازارمنتشر نخواهند شد. همچنین پس از انتشار برنامه در بازار، امکان تغییر دسته&zwnj;بندی آن وجود ندارد. لذا در انتخاب دسته&zwnj;بندی برنامه دقت لازم را به عمل آورید.&nbsp;</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">قیمت&zwnj;گذاری</h4>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">در قسمت &laquo;قیمت&zwnj;&raquo;، شما می&zwnj;توانید قیمتی برای برنامهٔ خود تعیین کنید و یا قیمت قبلی آن را تغییر دهید. فقط کافی است قیمت مورد نظر خود را وارد کرده و روی دکمهٔ &laquo;تغییر قیمت&raquo; کلیک کنید. دقت کنید که امکان تغییر قیمت برای برنامه&zwnj;های رایگانی که حداقل یک بار منتشرشده&zwnj;اند، وجود ندارد.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">تغییر قیمت&zwnj;ها، به صورت خودکار انجام می&zwnj;شود.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">اطلاعات پشتیبانی</h4>\r\n\r\n<p style=\"text-align:justify\">در سربرگ &laquo;اطلاعات&raquo; قسمت &laquo;اطلاعات پشتیبانی کاربر&raquo; می&zwnj;توانید اطلاعاتی را که برای ارتباط با کابران برنامه استفاده می&zwnj;شود (شماره تماس، پست الکترونیکی و آدرس سایت) را وارد کنید. وارد کردن ایمیل در این قسمت ضروری است.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">این مشخصات جهت ارتباط کاربران با شما در صفحهٔ برنامه&zwnj;تان نمایش داده خواهند شد.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">تصاویر</h4>\r\n\r\n<p style=\"text-align:justify\">با انتخاب برنامه و مراجعه به سر&rlm;برگ&zwnj; &laquo;تصاویر&raquo;، می&zwnj;توانید اطلاعات تصویری برنامهٔ خود (شامل آیکون، اسکرین&zwnj;شات&zwnj;ها و ویدیو) را تغییر دهید. دقت کنید که بارگذاری آیکون و حداقل ۵ اسکرین&zwnj;شات برای هر برنامه ضروری است.</p>\r\n\r\n<p style=\"text-align:justify\">ویدیوی برنامه&zwnj;ها به صورت لینکی از <a href=\"http://www.aparat.com/\">آپارات</a> دریافت می&zwnj;شود.</p>\r\n\r\n<p style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h4 style=\"text-align:justify\">درخواست انتشار</h4>\r\n\r\n<p style=\"text-align:justify\">پس از تکمیل فرآیند تکمیل مشخصات برنامه و بارگذاری بسته&zwnj;های مورد نظر خود، درخواست انتشار برنامهٔ خود را برای ما ارسال کنید. برای این کار کافی است در نوار بالای صفحه روی دکمهٔ &laquo;درخواست انتشار برنامه&raquo; کلیک کنید.</p>\r\n\r\n<p style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<h5 dir=\"rtl\" style=\"text-align:justify\">وضعیت برنامه&zwnj;</h5>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">هر برنامه&zwnj; می&zwnj;تواند وضعیت&zwnj;های مختلفی داشته باشد:</p>\r\n\r\n<ul>\r\n	<li dir=\"rtl\"><strong>بارگذاری شده:</strong>&nbsp;برنامه&zwnj;ای که به تازگی بارگذاری شده و هنوز درخواست انتشار برای آن ارسال نشده است. همچنین برنامه&zwnj;ای که انتشار آن توسط توسعه&zwnj;دهنده لغو شده است نیز در این وضعیت قرار می&zwnj;گیرد.</li>\r\n	<li dir=\"rtl\">\r\n	<p dir=\"rtl\"><strong>در صف انتظار:</strong>&nbsp;برنامه&zwnj;ای که در انتظار انتشار است.&nbsp;انتشار برنامه&zwnj;ها طی حداکثر ۵ روز&nbsp;<strong>کاری</strong>&nbsp;انجام می&zwnj;شوند&nbsp;(پنج&zwnj;شنبه&zwnj;ها و جمعه&zwnj;ها روز کاری محسوب نمی&zwnj;شوند).</p>\r\n	</li>\r\n	<li dir=\"rtl\">\r\n	<p dir=\"rtl\"><strong>نیاز به تغییرات:</strong>&nbsp;برنامه&zwnj;ای که برای انتشار نیاز به تغییراتی دارد. تغییرات مورد نیاز قبل از قرارگیری برنامه در این وضعیت، از طریق ایمیل به اطلاع شما خواهد رسید.</p>\r\n	</li>\r\n	<li dir=\"rtl\">\r\n	<p dir=\"rtl\"><strong>رد شده:</strong>&nbsp;برنامه&zwnj;ای که با شرایط بازار سازگار نیست و انتشار آن منتفی است. دلایل رد برنامه از طریق ایمیل به اطلاع شما می&zwnj;رسد.</p>\r\n	</li>\r\n	<li dir=\"rtl\"><strong>حذف شده:</strong>&nbsp;برنامه&zwnj;ای که قبلاً منتشرشده ولی در حال حاضر انتشار آن توسط بازار متوقف شده است.</li>\r\n	<li dir=\"rtl\">\r\n	<p dir=\"rtl\"><strong>آمادهٔ انتشار:</strong>&nbsp;برنامه&zwnj;ای که برای انتشار آماده است.</p>\r\n	</li>\r\n	<li dir=\"rtl\">\r\n	<p dir=\"rtl\"><strong>منتشر شده:</strong>&nbsp;برنامه&zwnj;ای که منتشر شده و در دسترس کاربران است.</p>\r\n	</li>\r\n</ul>\r\n\r\n<h4 style=\"text-align:justify\">انتشار خودکار یا دستی</h4>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">برنامهٔ شما پس از طی فرآیند انتشار، به صورت خودکار در کافه&zwnj;بازار منتشر خواهد شد. اگر می&zwnj;خواهید برنامه توسط شما منتشر شود؛ در زمان ارسال درخواست بررسی، انتشار خودکار را غیرفعال کنید و یا پس از ارسال درخواست انتشار، در نوار بالای صفحهٔ برنامه روی دکمهٔ &laquo;لغو انتشار خودکار&raquo; در نوار بالای صفحه کلیک کنید. در این صورت مشخص کردن زمان&zwnj; انتشار برای برنامه در اختیار شماست.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&nbsp;برای انتشار دستی برنامهٔ خود، در نوار بالای صفحهٔ برنامه روی دکمهٔ &laquo;انتشار برنامه&raquo; کلیک کنید. دقت داشته باشید که به دلیل همگام&zwnj;سازی سرورهای بازار، ممکن است انتشار برنامه حداکثر یک ساعت به طول انجامد.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">در صورتی که از تصمیم خود مبنی بر انتشار دستی منصرف شده&zwnj;اید؛ می&zwnj;توانید با کلیک روی دکمهٔ &laquo;فعال&zwnj;سازی انتشار خودکار&raquo; در نوار بالای صفحه&zwnj;ٔ برنامه به حالت اولیه (انتشار خودکار بلافاصله بعد از تأیید برنامه) بازگردید.</p>\r\n', 2);

-- --------------------------------------------------------

--
-- Table structure for table `ym_page_categories`
--

CREATE TABLE `ym_page_categories` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(255) DEFAULT NULL COMMENT 'عنوان',
  `slug` varchar(255) DEFAULT NULL COMMENT 'آدرس',
  `multiple` tinyint(1) UNSIGNED DEFAULT '1' COMMENT 'چند صحفه ای'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_page_categories`
--

INSERT INTO `ym_page_categories` (`id`, `name`, `slug`, `multiple`) VALUES
(1, 'صفحات استاتیک', 'base', 1),
(2, 'مستندات', 'document', 1);

-- --------------------------------------------------------

--
-- Table structure for table `ym_site_setting`
--

CREATE TABLE `ym_site_setting` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL,
  `value` text CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_site_setting`
--

INSERT INTO `ym_site_setting` (`id`, `name`, `title`, `value`) VALUES
(1, 'site_title', 'عنوان سایت', 'مرجع برنامه های موبایل'),
(2, 'default_title', 'عنوان پیش فرض صفحات', 'هایپر اپس'),
(3, 'keywords', 'کلمات کلیدی سایت', 'برنامه موبایل,android,ios,windowsphone,اندروید,ویندوز فون،هایپر اپس،مارکت هایپر اپس-مارکت اندروید'),
(4, 'site_description', 'شرح وبسایت', 'ارائه دهنده اپلیکیشن موبایل در سه پلتفرم اندروید ، iOS و ویندوز فون'),
(7, 'tax', 'میزان مالیات (درصد)', '9'),
(8, 'commission', 'حق کمیسیون (درصد)', '15'),
(5, 'buy_credit_options', 'گزینه های خرید اعتبار', '[\"5000\",\"10000\",\"20000\",\"500\"]'),
(6, 'min_credit', 'حداقل اعتبار جهت تبدیل عضویت', '500'),
(9, 'gateway_active', 'درگاه فعال', 'zarinpal'),
(10, 'gateway_variables', 'اطلاعات درگاه', '{\"merchant_id\":\"b5c45350-3fc8-11e7-ba1c-005056a205be\",\"terminalId\":\"asfafs\",\"userName\":\"asf\",\"userPassword\":\"asfafagfdbdfv\"}');

-- --------------------------------------------------------

--
-- Table structure for table `ym_tickets`
--

CREATE TABLE `ym_tickets` (
  `id` int(10) UNSIGNED NOT NULL,
  `code` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'شناسه تیکت',
  `user_id` int(10) UNSIGNED DEFAULT NULL,
  `status` enum('answered','waiting','pending','open','close') COLLATE utf8_persian_ci DEFAULT 'waiting' COMMENT 'وضعیت تیکت',
  `date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تاریخ',
  `subject` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'موضوع',
  `department_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'بخش'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_ticket_departments`
--

CREATE TABLE `ym_ticket_departments` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'عنوان'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `ym_ticket_departments`
--

INSERT INTO `ym_ticket_departments` (`id`, `title`) VALUES
(1, 'مدیریت'),
(2, 'امور مالی'),
(3, 'پشتیبانی فنی');

-- --------------------------------------------------------

--
-- Table structure for table `ym_ticket_messages`
--

CREATE TABLE `ym_ticket_messages` (
  `id` int(10) UNSIGNED NOT NULL,
  `ticket_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'تیکت',
  `sender` enum('admin','supporter','user') COLLATE utf8_persian_ci DEFAULT NULL,
  `date` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تاریخ',
  `text` text COLLATE utf8_persian_ci COMMENT 'متن',
  `attachment` varchar(500) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'فایل ضمیمه',
  `visit` tinyint(1) UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ym_users`
--

CREATE TABLE `ym_users` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `email` varchar(255) NOT NULL COMMENT 'پست الکترونیک',
  `role_id` int(10) UNSIGNED DEFAULT NULL,
  `create_date` varchar(20) DEFAULT NULL,
  `status` enum('pending','active','blocked','deleted') DEFAULT 'pending',
  `verification_token` varchar(100) DEFAULT NULL,
  `change_password_request_count` int(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ym_users`
--

INSERT INTO `ym_users` (`id`, `username`, `password`, `email`, `role_id`, `create_date`, `status`, `verification_token`, `change_password_request_count`) VALUES
(1, '', '$2a$12$DKfzxMPmL4JGZOE8R28WweBLalZP/FLn7WNYAJcRG2trWNxuigCAm', 'user@test.com', 1, '1502468426', 'active', '955b27f6975d14f391d5d8bcac3aebf7', 0),
(2, '', '$2a$12$paBvjiEtT7n3vM67itn9Z.UyGcdoY.KDXhXhLZ0PUeK3TwkxWv79m', 'developer@test.com', 2, '1502468518', 'active', 'dea2cf6a091e9bf9668315d44097b4a7', 0);

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_app_bookmark`
--

CREATE TABLE `ym_user_app_bookmark` (
  `user_id` int(10) UNSIGNED DEFAULT NULL,
  `app_id` int(10) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_details`
--

CREATE TABLE `ym_user_details` (
  `user_id` int(10) UNSIGNED NOT NULL COMMENT 'کاربر',
  `fa_name` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'نام فارسی',
  `en_name` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'نام انگلیسی',
  `fa_web_url` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'آدرس سایت فارسی',
  `en_web_url` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'آدرس سایت انگلیسی',
  `national_code` varchar(10) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'کد ملی',
  `national_card_image` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تصویر کارت ملی',
  `phone` varchar(11) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'تلفن',
  `zip_code` varchar(10) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'کد پستی',
  `address` varchar(1000) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'نشانی دقیق پستی',
  `credit` double DEFAULT NULL COMMENT 'اعتبار',
  `developer_id` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'شناسه توسعه دهنده',
  `details_status` enum('refused','pending','accepted') CHARACTER SET utf8 DEFAULT 'pending' COMMENT 'وضعیت اطلاعات کاربر',
  `monthly_settlement` tinyint(4) DEFAULT '0' COMMENT 'تسویه حساب ماهانه',
  `iban` varchar(24) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'شماره شبا',
  `nickname` varchar(20) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'نام نمایشی',
  `type` enum('real','legal') CHARACTER SET utf8 DEFAULT 'real' COMMENT 'نوع حساب',
  `post` enum('ceo','board') CHARACTER SET utf8 DEFAULT NULL COMMENT 'سمت',
  `company_name` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'نام شرکت',
  `registration_number` varchar(50) COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'شماره ثبت',
  `registration_certificate_image` varchar(50) CHARACTER SET utf8 DEFAULT NULL COMMENT 'تصویر گواهی ثبت شرکت',
  `score` int(10) UNSIGNED DEFAULT '0' COMMENT 'امتیاز',
  `dev_score` int(10) UNSIGNED DEFAULT '0' COMMENT 'امتیاز توسعه دهنده',
  `earning` decimal(10,0) UNSIGNED DEFAULT '0' COMMENT 'درآمد'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `ym_user_details`
--

INSERT INTO `ym_user_details` (`user_id`, `fa_name`, `en_name`, `fa_web_url`, `en_web_url`, `national_code`, `national_card_image`, `phone`, `zip_code`, `address`, `credit`, `developer_id`, `details_status`, `monthly_settlement`, `iban`, `nickname`, `type`, `post`, `company_name`, `registration_number`, `registration_certificate_image`, `score`, `dev_score`, `earning`) VALUES
(1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'pending', 0, NULL, NULL, 'real', NULL, NULL, NULL, NULL, 0, 0, '0'),
(2, 'یوسف مبشری', 'Yusef Mobasheri', '', '', '0370544651', 'SdzOt1502522087.png', '09358389265', '3718146164', 'asfasdasf', 0, 'Yusef', 'accepted', 0, NULL, 'Salar', 'real', NULL, NULL, NULL, NULL, 0, 1, '76');

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_dev_id_requests`
--

CREATE TABLE `ym_user_dev_id_requests` (
  `user_id` int(10) UNSIGNED NOT NULL COMMENT 'کاربر',
  `requested_id` varchar(20) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'شناسه درخواستی'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_notifications`
--

CREATE TABLE `ym_user_notifications` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'شناسه',
  `user_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'کاربر',
  `message` varchar(500) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'متن پیام',
  `seen` tinyint(4) NOT NULL COMMENT 'مشاهده شده',
  `date` varchar(30) NOT NULL COMMENT 'زمان'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_roles`
--

CREATE TABLE `ym_user_roles` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `role` varchar(255) COLLATE utf8_persian_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `ym_user_roles`
--

INSERT INTO `ym_user_roles` (`id`, `name`, `role`) VALUES
(1, 'کاربر معمولی', 'user'),
(2, 'توسعه دهنده', 'developer');

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_settlement`
--

CREATE TABLE `ym_user_settlement` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'شناسه',
  `user_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'کاربر',
  `amount` varchar(15) DEFAULT NULL COMMENT 'مبلغ',
  `date` varchar(20) DEFAULT NULL COMMENT 'تاریخ',
  `iban` varchar(24) DEFAULT NULL COMMENT 'شماره شبا',
  `token` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT 'کد رهگیری'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `ym_user_transactions`
--

CREATE TABLE `ym_user_transactions` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'شناسه',
  `user_id` int(10) UNSIGNED DEFAULT NULL COMMENT 'کاربر',
  `amount` varchar(10) DEFAULT NULL COMMENT 'مقدار',
  `date` varchar(20) DEFAULT NULL COMMENT 'تاریخ',
  `status` enum('unpaid','paid') DEFAULT 'unpaid' COMMENT 'وضعیت',
  `token` varchar(50) DEFAULT NULL COMMENT 'کد رهگیری',
  `description` varchar(200) CHARACTER SET utf8 COLLATE utf8_persian_ci DEFAULT NULL COMMENT 'توضیحات',
  `authority` varchar(200) NOT NULL,
  `gateway_name` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `ym_admins`
--
ALTER TABLE `ym_admins`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role_id` (`role_id`);

--
-- Indexes for table `ym_admin_roles`
--
ALTER TABLE `ym_admin_roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_apps`
--
ALTER TABLE `ym_apps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `developer_id` (`developer_id`),
  ADD KEY `category_id` (`category_id`),
  ADD KEY `platform_id` (`platform_id`);

--
-- Indexes for table `ym_app_advertises`
--
ALTER TABLE `ym_app_advertises`
  ADD PRIMARY KEY (`app_id`);

--
-- Indexes for table `ym_app_buys`
--
ALTER TABLE `ym_app_buys`
  ADD PRIMARY KEY (`id`),
  ADD KEY `app_id` (`app_id`) USING BTREE,
  ADD KEY `user_id` (`user_id`) USING BTREE;

--
-- Indexes for table `ym_app_categories`
--
ALTER TABLE `ym_app_categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parent_id` (`parent_id`);

--
-- Indexes for table `ym_app_discounts`
--
ALTER TABLE `ym_app_discounts`
  ADD PRIMARY KEY (`app_id`);

--
-- Indexes for table `ym_app_images`
--
ALTER TABLE `ym_app_images`
  ADD PRIMARY KEY (`id`),
  ADD KEY `app_id` (`app_id`);

--
-- Indexes for table `ym_app_packages`
--
ALTER TABLE `ym_app_packages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `app_id` (`app_id`);

--
-- Indexes for table `ym_app_platforms`
--
ALTER TABLE `ym_app_platforms`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_app_ratings`
--
ALTER TABLE `ym_app_ratings`
  ADD PRIMARY KEY (`user_id`,`app_id`),
  ADD KEY `app_id` (`app_id`);

--
-- Indexes for table `ym_app_special_advertises`
--
ALTER TABLE `ym_app_special_advertises`
  ADD PRIMARY KEY (`app_id`);

--
-- Indexes for table `ym_comments`
--
ALTER TABLE `ym_comments`
  ADD PRIMARY KEY (`comment_id`),
  ADD KEY `owner_name` (`owner_name`,`owner_id`);

--
-- Indexes for table `ym_counter_save`
--
ALTER TABLE `ym_counter_save`
  ADD PRIMARY KEY (`save_name`);

--
-- Indexes for table `ym_counter_users`
--
ALTER TABLE `ym_counter_users`
  ADD PRIMARY KEY (`user_ip`);

--
-- Indexes for table `ym_pages`
--
ALTER TABLE `ym_pages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`);

--
-- Indexes for table `ym_page_categories`
--
ALTER TABLE `ym_page_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_site_setting`
--
ALTER TABLE `ym_site_setting`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_tickets`
--
ALTER TABLE `ym_tickets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `department_id` (`department_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `ym_ticket_departments`
--
ALTER TABLE `ym_ticket_departments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_ticket_messages`
--
ALTER TABLE `ym_ticket_messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ticket_id` (`ticket_id`);

--
-- Indexes for table `ym_users`
--
ALTER TABLE `ym_users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role_id` (`role_id`);

--
-- Indexes for table `ym_user_app_bookmark`
--
ALTER TABLE `ym_user_app_bookmark`
  ADD KEY `user_id` (`user_id`),
  ADD KEY `app_id` (`app_id`);

--
-- Indexes for table `ym_user_details`
--
ALTER TABLE `ym_user_details`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `ym_user_dev_id_requests`
--
ALTER TABLE `ym_user_dev_id_requests`
  ADD PRIMARY KEY (`user_id`);

--
-- Indexes for table `ym_user_notifications`
--
ALTER TABLE `ym_user_notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `ym_user_roles`
--
ALTER TABLE `ym_user_roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ym_user_settlement`
--
ALTER TABLE `ym_user_settlement`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `ym_user_transactions`
--
ALTER TABLE `ym_user_transactions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `ym_admins`
--
ALTER TABLE `ym_admins`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;
--
-- AUTO_INCREMENT for table `ym_admin_roles`
--
ALTER TABLE `ym_admin_roles`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `ym_apps`
--
ALTER TABLE `ym_apps`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `ym_app_buys`
--
ALTER TABLE `ym_app_buys`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `ym_app_categories`
--
ALTER TABLE `ym_app_categories`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;
--
-- AUTO_INCREMENT for table `ym_app_images`
--
ALTER TABLE `ym_app_images`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `ym_app_packages`
--
ALTER TABLE `ym_app_packages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'شناسه';
--
-- AUTO_INCREMENT for table `ym_app_platforms`
--
ALTER TABLE `ym_app_platforms`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `ym_comments`
--
ALTER TABLE `ym_comments`
  MODIFY `comment_id` int(12) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `ym_pages`
--
ALTER TABLE `ym_pages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
--
-- AUTO_INCREMENT for table `ym_page_categories`
--
ALTER TABLE `ym_page_categories`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `ym_site_setting`
--
ALTER TABLE `ym_site_setting`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `ym_tickets`
--
ALTER TABLE `ym_tickets`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `ym_ticket_departments`
--
ALTER TABLE `ym_ticket_departments`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `ym_ticket_messages`
--
ALTER TABLE `ym_ticket_messages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `ym_users`
--
ALTER TABLE `ym_users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `ym_user_notifications`
--
ALTER TABLE `ym_user_notifications`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'شناسه';
--
-- AUTO_INCREMENT for table `ym_user_roles`
--
ALTER TABLE `ym_user_roles`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `ym_user_settlement`
--
ALTER TABLE `ym_user_settlement`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'شناسه';
--
-- AUTO_INCREMENT for table `ym_user_transactions`
--
ALTER TABLE `ym_user_transactions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'شناسه';
--
-- Constraints for dumped tables
--

--
-- Constraints for table `ym_admins`
--
ALTER TABLE `ym_admins`
  ADD CONSTRAINT `ym_admins_ibfk_1` FOREIGN KEY (`role_id`) REFERENCES `ym_admin_roles` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_apps`
--
ALTER TABLE `ym_apps`
  ADD CONSTRAINT `ym_apps_ibfk_1` FOREIGN KEY (`developer_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_apps_ibfk_2` FOREIGN KEY (`category_id`) REFERENCES `ym_app_categories` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_apps_ibfk_3` FOREIGN KEY (`platform_id`) REFERENCES `ym_app_platforms` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_advertises`
--
ALTER TABLE `ym_app_advertises`
  ADD CONSTRAINT `ym_app_advertises_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_buys`
--
ALTER TABLE `ym_app_buys`
  ADD CONSTRAINT `ym_app_buys_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_app_buys_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_categories`
--
ALTER TABLE `ym_app_categories`
  ADD CONSTRAINT `ym_app_categories_ibfk_1` FOREIGN KEY (`parent_id`) REFERENCES `ym_app_categories` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_discounts`
--
ALTER TABLE `ym_app_discounts`
  ADD CONSTRAINT `ym_app_discounts_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_images`
--
ALTER TABLE `ym_app_images`
  ADD CONSTRAINT `ym_app_images_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_packages`
--
ALTER TABLE `ym_app_packages`
  ADD CONSTRAINT `ym_app_packages_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_ratings`
--
ALTER TABLE `ym_app_ratings`
  ADD CONSTRAINT `ym_app_ratings_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_app_ratings_ibfk_2` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_app_special_advertises`
--
ALTER TABLE `ym_app_special_advertises`
  ADD CONSTRAINT `ym_app_special_advertises_ibfk_1` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_pages`
--
ALTER TABLE `ym_pages`
  ADD CONSTRAINT `ym_pages_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `ym_page_categories` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_tickets`
--
ALTER TABLE `ym_tickets`
  ADD CONSTRAINT `ym_tickets_ibfk_1` FOREIGN KEY (`department_id`) REFERENCES `ym_ticket_departments` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_tickets_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_ticket_messages`
--
ALTER TABLE `ym_ticket_messages`
  ADD CONSTRAINT `ym_ticket_messages_ibfk_1` FOREIGN KEY (`ticket_id`) REFERENCES `ym_tickets` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_users`
--
ALTER TABLE `ym_users`
  ADD CONSTRAINT `ym_users_ibfk_1` FOREIGN KEY (`role_id`) REFERENCES `ym_user_roles` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_user_app_bookmark`
--
ALTER TABLE `ym_user_app_bookmark`
  ADD CONSTRAINT `ym_user_app_bookmark_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `ym_user_app_bookmark_ibfk_2` FOREIGN KEY (`app_id`) REFERENCES `ym_apps` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_user_details`
--
ALTER TABLE `ym_user_details`
  ADD CONSTRAINT `ym_user_details_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_user_dev_id_requests`
--
ALTER TABLE `ym_user_dev_id_requests`
  ADD CONSTRAINT `ym_user_dev_id_requests_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_user_settlement`
--
ALTER TABLE `ym_user_settlement`
  ADD CONSTRAINT `ym_user_settlement_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

--
-- Constraints for table `ym_user_transactions`
--
ALTER TABLE `ym_user_transactions`
  ADD CONSTRAINT `ym_user_transactions_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `ym_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
